<a href="https://colab.research.google.com/github/mehmetsar/challenges/blob/main/sql_questions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Use chinook database sql

Questions:

Single-Row Subqueries:

Write a query to find the maximum duration among the tracks. Your query should include TrackId, Name, Milliseconds.

Write a query to find the minimum duration among the tracks. Your query should include TrackId, Name, Milliseconds.

Write a query to find the tracks whose bytes are higher than the average of the bytes of all tracks. Your query should include TrackId, Name, Bytes, general average and should be ordered by Bytes from highest to lowest. General average is the average of all tracks. General average should repeat in every row. (Hint: You need to use two subqueries)

   Multiple-Row Subqueries:

Write a query that returns the customers whose sales representatives are Jane Peacock and Margaret Park. Your query should include CustomerID, First Name and Last Name of the customers.

Rewrite the subquery above using the JOIN.

   DDL (CREATE, ALTER, DELETE) and DML (SELECT, INSERT, UPDATE, DELETE) Statements

Create a table inside the chinook database. This table tracks the employees’ courses inside the organization. Your table should have the followings features:

               Name of the table: courses
               Columns:
                    CourseId (Primary Key)
                    CourseName (Cannot be null)
                    EmployeeId (Foreign Key - Refers to EmployeeId of employees table ) 
                    CoursePrice

      2. Insert at least 5 rows into the courses table. Your EmployeeId should contain the values of the EmployeeId column on the employees table. You’re free to choose any values for other columns (CourseId, CourseName, CoursePrice)
Delete the last row of your courses table.

Add a new column to your courses table named StartDate. The new column cannot be null.

Delete the CoursePrice column.

Delete the courses table.


Single-Row Queries

1. SELECT TrackId, Name, Milliseconds FROM tracks ORDER BY Milliseconds DESC LIMIT 1 

2. SELECT TrackId, Name, Milliseconds FROM tracks ORDER BY Milliseconds ASC LIMIT 1 

3. SELECT TrackId, Name, Bytes FROM tracks WHERE Bytes> (SELECT avg(Bytes) FROM tracks)

Multiple-Row Subqueries

1.SELECT  customers.CustomerId, customers.FirstName, customers.LastName FROM customers where SupportRepId IN (select EmployeeId from employees where EmployeeId=3 or EmployeeId=4)

2.SELECT  customers.CustomerId, customers.FirstName, customers.LastName FROM customers left JOIN employees on employees.EmployeeId=customers.SupportRepId WHERE  employees.EmployeeId IN (3,4)



DDL and DML

1. Create  table courses (

                    CourseId  INT Primary Key,

                    CourseName TEXT NOTNULL,

                    EmployeeId INT ,

                    CoursePrice INT,

					FOREIGN KEY (EmployeeId)

					 REFERENCES employees(EmployeeId) )

					 ;

2.INSERT INTO courses (CourseId, CourseName, EmployeeId, CoursePrice)

VALUES (1,"Math",1,15),

       (2,"English",3,20),

	   (3,"Math",4,15),

	   (4,"M. learning",6,45);

3.DELETE FROM courses where "Courseid"=5;

4. ALTER TABLE courses  ADD StartDate date NOT NULL "1.1.2020";

5. ALTER TABLE Courses
DROP COLUMN CoursePrice;

6.Drop Table Courses;